In [1]:
''' 
Warmup: 
1) Creates a set of 10 evenly spaced values from 10 - 100. 
2) plt.subplots(1, 4)
3) plt.subplots(4, 1)
4) plt.legend()
5) 
import matplotlib.pyplot as plt
x = np.linspace(0, 4*pi, 8)
y = tan(x)
plt.figure()
plt.plot(x, y)
plt.show
'''

' \nWarmup: \n1) Creates a set of 10 evenly spaced values from 10 - 100. \n2) plt.subplots(1, 4)\n3) plt.subplots(4, 1)\n4) plt.legend()\n5) \nimport matplotlib.pyplot as plt\nx = np.linspace(0, 4*pi, 8)\ny = tan(x)\nplt.figure()\nplt.plot(x, y)\nplt.show\n'

In [2]:
import numpy as np
import pandas as pd

In [3]:
panda = pd.Series([14, 26, 22, 1065])
panda

0      14
1      26
2      22
3    1065
dtype: int64

In [7]:
panda.mean()

np.float64(281.75)

In [6]:
panda.max()

1065

In [8]:
panda.min()

14

In [35]:
data = {
"Name" :["Sarah", "Jose", "Macklemore"], 
"Age" : [5, 82, 42],
"City" : ["Rancho Cucamongo", "Weed", "Kent"]
}
macklemore = pd.DataFrame(data)
print(macklemore.keys())

Index(['Name', 'Age', 'City'], dtype='object')

In [36]:
list1 = [1, 2, 3, 4]
list[0]
macklemore[["Name", "City"]]

         Name              City
0       Sarah  Rancho Cucamongo
1        Jose              Weed
2  Macklemore              Kent

In [38]:
macklemore.loc[0]

Name               Sarah
Age                    5
City    Rancho Cucamongo
Name: 0, dtype: object

In [39]:
macklemore[macklemore["Age"] > 5]

         Name  Age  City
1        Jose   82  Weed
2  Macklemore   42  Kent

In [41]:
macklemore[macklemore["City"] == "Rancho Cucamongo"]

    Name  Age              City
0  Sarah    5  Rancho Cucamongo

In [43]:
macklemore["Age"] = macklemore["Age"] + 1
macklemore

         Name  Age              City
0       Sarah    7  Rancho Cucamongo
1        Jose   84              Weed
2  Macklemore   44              Kent

In [44]:
macklemore["Senior Citizen?"] = macklemore["Age"] > 65
macklemore

         Name  Age              City  Senior Citizen?
0       Sarah    7  Rancho Cucamongo            False
1        Jose   84              Weed             True
2  Macklemore   44              Kent            False

In [52]:
df = pd.read_csv("students.csv")
df.head(3)

      Name  Age  Grade    Major
0    Alice   22     89     Math
1      Bob   24     72  History
2  Charlie   21     95  Physics

In [55]:
df["Grade"].mean()

np.float64(83.8)

In [59]:
df[df["Grade"] > 85]

      Name  Age  Grade    Major
0    Alice   22     89     Math
2  Charlie   21     95  Physics
3    Daisy   23     88     Math

In [60]:
people_per_major = df["Major"].value_counts()
people_per_major

Major
Math       2
History    2
Physics    1
Name: count, dtype: int64

In [62]:
df["pass"] = df["Grade"] > 75
df

      Name  Age  Grade    Major   pass
0    Alice   22     89     Math   True
1      Bob   24     72  History  False
2  Charlie   21     95  Physics   True
3    Daisy   23     88     Math   True
4     Evan   24     75  History  False